//every, some:
//17. Дан массив с числами. Проверьте то, что все элементы в массиве больше нуля.

let a = [3, 4, 1, 2, 7];

console.log(a);

let c = a.every(elem => elem > 0);

console.log(`Все элементы массива больше 0? ${c}`);


//---------------------------


let b = [3, 4, 0, 2, 7];

console.log(b);

let d = b.every(elem => elem > 0);

console.log(`Все элементы массива больше 0? ${d}`);


//============= НЕПОНЯТНО!!! =====================================================


let e = [3, 4, 1, 2, 7];

console.log(e);

let f = e.some(elem => elem > 0);

console.log(`Все элементы массива больше 0? ${f}`);


//---------------------------


let g = [3, 4, 0, -1, 7];

console.log(g);

let k = g.some(elem => elem > 0);

console.log(`Все элементы массива больше 0? ${k}`);